// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   SermodeStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell sermode command
// 
// Revision History:
//  
// --*/

/=#

#langdef   eng "English"

#string STR_SERMODE_INVALID_STOP_BITS  #language eng  "%Hsermode%N: Invalid stop bits parameter\n"

#string STR_SERMODE_NO_SERIAL_PORTS    #language eng  "%Hsermode%N: No serial ports present\n"

#string STR_SERMODE_CANNOT_SET_ATTR    #language eng  "%Hsermode%N: Cannot set attributes on handle %08x - %r\n"

#string STR_SERMODE_MODE_SET_ON_HANDLE #language eng  "%Hsermode%N: Mode set on handle %08x\n"

#string STR_SERMODE_INVALID_PARITY_PARAM #language eng  "%Hsermode%N: Invalid parity parameter.\n"

#string STR_SERMODE__NOT_SER_HANDLE    #language eng  "%Hsermode%N: Handle - %x is not a serial device handle.\n"

#string STR_SERMODE_DISPLAY            #language eng  "%x(%08x) - (%ld, %c, %d, %s)\n"

#string STR_SERMODE_NOT_FOUND          #language eng  "%Hsermode%N: No serial port or specified serial port found.\n"

#string STR_SERMODE_LINE_HELP          #language eng  "Sets attributes of serial port"

#string STR_SERMODE_VERBOSE_HELP        #language eng "Sets attributes of serial port.\n"
                                                      "\n"
                                                      "SERMODE [handle [baudrate parity databits stop bits]]\n"
                                                      "\n"
                                                      "    handle      - Device handle for a serial port\n"
                                                      "    baudrate    - Baud rate for specified serial port\n"
                                                      "    parity      - 'd', 'n', 'e', 'o', 'm', 's' or combination of them:\n"
                                                      "                  d - Default parity\n"
                                                      "                  n - No parity\n"
                                                      "                  e - Even parity\n"
                                                      "                  o - Odd parity\n"
                                                      "                  m - Mark parity\n"
                                                      "                  s - Space parity\n"
                                                      "    databits    - Data bits for specified serial port\n"
                                                      "    stopbits    - Stop bits for specified serial port\n"
                                                      "\n"
                                                      "Notes: \n"
                                                      "    1. Parameter 'handle' is the device handle of serial port, user can \n"
                                                      "       get it by running command 'DH'.\n"
                                                      "    2. Parameter 'stopbits' has 4 valid values:\n"
                                                      "         0(default stop bit), 1(one stop bit), 2(two stop bits) and\n"
                                                      "         15(1.5 stop bits). \n"
                                                      "       All other values are invalid.\n"
                                                      "    3. Valid values for parameter 'baudrate' are:\n"
                                                      "        50, 75, 110, 150, 300, 600, 1200, 1800, 2000, 2400, 3600, 4800, \n"
                                                      "        7200, 9600(default), 19200, 38400, 57600, 115200, 230400, 460800\n"
                                                      "       All other values will be converted to the nearest one above.\n"
                                                      "    4. Valid values for databits are:\n"
                                                      "         4, 7, 8(default)\n"
                                                      "       All other values are invalid.\n"
                                                      "    5. Parity attributes are mutually exclusive with each other, only one of\n"
                                                      "       them can be placed in the command line at a time.\n"
                                                      "Examples:\n"
                                                      "  * To display all serial ports' settings:\n"
                                                      "    Shell> sermode\n"
                                                      "    4F06B08 - (115200, N, 8, 1)\n"
                                                      "    4F05F88 - (115200, N, 8, 1)\n"
                                                      "\n"
                                                      "  * To display serial port's setting whose handle is 0x6B:\n"
                                                      "    Shell> sermode 6B\n"
                                                      "    4F06B08 - (115200, N, 8, 1)\n"
                                                      "\n"
                                                      "  * To set serial port with handle 0x6B to 9600bps, even parity, 8 data bits\n"
                                                      "    and 1 stop bit:        \n"
                                                      "    Shell> sermode 6B 9600 e 8 1  \n"
                                                      "    sermode: Mode set on handle 04F06B08\n"


   